blog/advent-of-code-2020-day-two.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-12-02 Mi 18:07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Advent of Code 2020, Day 2</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Keshab Paudel">
<link rel='stylesheet' href='../static/index.css' />
</head>
<body>
<div id="content">
<h1 class="title">Advent of Code 2020, Day 2</h1>
<p>
Day two of the advent calendar, I decided not to do it first in python
to focus only on Clojure.
</p>

<p>
I put the repo with all solutions on github. But I'm not beneath
adding some padding to blog.
</p>

<div id="outline-container-org6db42e1" class="outline-2">
<h2 id="org6db42e1">Part One</h2>
<div class="outline-text-2" id="text-org6db42e1">
<p>
This is my first time doing the advent of code, even though it has
been going on for about 5 years.
</p>

<p>
Which is why I didn't realize that every challenge has more than one
parts. Just like yesterday.
</p>

<p>
This is what I came up with. It took me a lot more than I'd
anticipated.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(def regex #"(?&lt;min&gt;\d+)-(?&lt;max&gt;\d+)\s+(?&lt;letter&gt;\w):\s+(?&lt;password&gt;.*)")
(def input-file-path (str (.getCanonicalPath (clojure.java.io/file ".")) "/resources/day2-input.txt"))


(defn parse-line [line]
  "Parse each line and return a vector containing
  [min max char password] or nil"

  (let [[_ min max letter password]
	(re-matches regex line)]

    (if (and min max letter password)
      [(Integer/parseInt min)
       (Integer/parseInt max)
       (first (char-array letter))
       password])))


(defn is-valid?
  "Predicate. Checks if a given password string
  adheres to the given password policy."

  [line]

  (let [[min max char password :as parsed] (parse-line line)
	lcount (get (frequencies password) char 0)]

    (boolean
     (and
      parsed
      (&lt;= lcount max)
      (&gt;= lcount min)))))


(defn part1 []
   (count
    (filter
     is-valid?
     (line-seq (clojure.java.io/reader input-file-path)))))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbe03d29" class="outline-2">
<h2 id="orgbe03d29">Part Two</h2>
<div class="outline-text-2" id="text-orgbe03d29">
<p>
Most of the functions defined in part one were usable in part two as
well. I didn't have to refactor everything like I had to yesterday.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(defn is-valid-two?
  [line]
  (let [[x y char password :as parsed] (parse-line line)
	password-arr (char-array password)
	x-exists (= (get password-arr (- x 1)) char)
	y-exists (= (get password-arr (- y 1)) char)]
    (and (or x-exists y-exists)
	 (not (and x-exists y-exists)))))


(defn part2 []
  (count
   (filter
    is-valid-two?
    (line-seq (clojure.java.io/reader input-file-path)))))
</pre>
</div>

<p>
There is a little bit of duplication between part1 and part2 but it's
something that I can live with.
</p>
</div>
</div>

<div id="outline-container-org2998ece" class="outline-2">
<h2 id="org2998ece">Notes</h2>
<div class="outline-text-2" id="text-org2998ece">
<p>
I learned how to unpack (a.k.a. destructure in clojure land) a
vector (or any sequence) in arguments or in a <code>let</code>.
</p>

<p>
For challenge part2, I might be able to make it a little more elegant.
But that's for the future.
</p>

<p>
I also did some re-organization so that <code>lein run</code> command that runs
the <code>main</code> method from <code>core</code> can be used to run solutions to all
challenges.
</p>

<p>
Using regex was fairly simple. My favorite regex101.com doesn
explicitly have support for Clojure (or Java, for that matter) but
JavaScript regex engine is very similar to the one in Java.
</p>

<p>
The `slurp` function is amazing.
</p>
</div>
</div>

<div id="outline-container-org007a80b" class="outline-2">
<h2 id="org007a80b">Links</h2>
<div class="outline-text-2" id="text-org007a80b">
<ol class="org-ol">
<li><a href="../static/advent-2020-input-day-two.txt">advent-2020-input-day-two.txt</a></li>
<li><a href="./advent-of-code-2020-day-one.html">Day 1</a> of the challenge</li>
<li><a href="https://github.com/poudel/advent-2020-clj">github</a> repo of the solution</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-12-02 Mi 17:44</p>
<p class="author">Author: Keshab Paudel</p>
<p class="date">Created: 2020-12-02 Mi 18:07</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
